Tekla.Structures.ModelInternal.dotTemporaryTransparenciesEnum
The possible temporary transparencies. Used to temporarily change transparency
of a model object to visualize some state in the model.

Tekla.Structures.ModelInternal.dotTemporaryTransparenciesEnum.DOT_TEMPORARY_TRANSPARENCY_HIDDEN
Object is hidden.

Tekla.Structures.ModelInternal.dotTemporaryTransparenciesEnum.DOT_TEMPORARY_TRANSPARENCY_TRANSPARENT
Object is transparent.

Tekla.Structures.ModelInternal.dotTemporaryTransparenciesEnum.DOT_TEMPORARY_TRANSPARENCY_SEMITRANSPARENT
Object is semi transparent.

Tekla.Structures.ModelInternal.dotTemporaryTransparenciesEnum.DOT_TEMPORARY_TRANSPARENCY_SEMIVISIBLE
Object is almost fully visible.

Tekla.Structures.ModelInternal.dotTemporaryTransparenciesEnum.DOT_TEMPORARY_TRANSPARENCY_VISIBLE
Object is fully visible.